/*
*********************************************************************************************************
*
*   模块名称 : 简易OS代码
*   文件名称 : bsp_tpc.c
*   版    本 : V1.0
*   说    明 : 提供简单的基于时间片轮询的机制
*
*********************************************************************************************************
*/
#include "bsp_tpc.h"  // 头文件

uint8_t TPCTaskNum = 0;//任务数量，在bsp_task.c中被初始化

/*
*********************************************************************************************************
*   函 数 名: TPCRemarks
*   功能说明: 任务标志处理，分为静态任务和动态任务来进行处理，动态任务是根据需要修改attrb属性的任务
              在systimer的定时中断中得到执行，目前是1ms进入一次，进行判别
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
void TPCRemarks(TPC_TASK *pTask)
{
    uint8_t i;

    for (i=0; i<TPCTaskNum; i++)
    {
        if(pTask[i].attrb == 0)//如果是静态任务
        {
            if (pTask[i].Timer > 0)
            {
                pTask[i].Timer--; // 减去一个节拍

                if (pTask[i].Timer == 0)  // 时间减完了
                {
                    if(pTask[i].attrb == 0)//如果是静态任务，循环执行，ItvTime赋值，动态任务执行一次
                    {
                        pTask[i].Timer = pTask[i].ItvTime;  // 恢复计时器值
                    }
                    pTask[i].Run   = TPC_RUN_STM; // 置运行标志
                }
            }
        }
    }
}

/*
*********************************************************************************************************
*   函 数 名: TPCProcess
*   功能说明: 任务标志处理
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
void TPCProcess(TPC_TASK *pTask)
{
    uint8_t i;

    for (i=0; i<TPCTaskNum; i++)
    {
        if (pTask[i].Run == TPC_RUN_STM)  // 运行标志判断
        {
            pTask[i].Task();  // 运行任务
            pTask[i].Run = TPC_RUN_CLM; // 标志清0，等待延时时间到，再次变为可运行态
        }
    }
}


